app/controllers/videos_controller.rb

  def index
    @videos = Video.all
---
SELECT "videos".* FROM "videos" ORDER BY created_at

  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save
---
INSERT INTO "videos" ("created_at", "updated_at", "attach_video_file_name", "attach_video_content_type", "attach_video_file_size", "attach_video_updated_at") VALUES (?, ?, ?, ?, ?, ?)